# Pandas

Let's practice with Pandas dataframes and series!

In [1]:
#Run these imports first
import numpy as np
import pandas as pd

### Series

Let's make a series, including one field with NaN (an empty value).

In [2]:
s = pd.Series([1,3,5,np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
# Accessing a member of the series:

s[4]

6.0

### Dataframes

Here we define dataframe.

In [4]:
df = pd.DataFrame({'date' : ['2016-01-01', '2016-01-02', '2016-01-03'],
                    'qty': [20, 30, 40]})
df

         date  qty
0  2016-01-01   20
1  2016-01-02   30
2  2016-01-03   40

Larger data should be loaded from a file.

In [5]:
rain = pd.read_csv('../../data/rainfall/rainfall.csv')
rain

             City Month  Rainfall
0   San Francisco   Jan      10.0
1         Seattle   Jan      30.0
2     Los Angeles   Jan       2.0
3         Seattle   Feb      20.0
4   San Francisco   Feb       4.0
5     Los Angeles   Feb       0.0
6         Seattle   Mar      22.0
7   San Francisco   Mar       4.0
8     Los Angeles   Mar       NaN
9         Seattle   Apr       NaN
10  San Francisco   Apr       5.0
11    Los Angeles   Apr       4.0

In [6]:
# Let's load a column
rain['City']

0     San Francisco
1           Seattle
2       Los Angeles
3           Seattle
4     San Francisco
5       Los Angeles
6           Seattle
7     San Francisco
8       Los Angeles
9           Seattle
10    San Francisco
11      Los Angeles
Name: City, dtype: object

In [7]:
# Let's load a row
rain.loc[[1]]

      City Month  Rainfall
1  Seattle   Jan      30.0

In [8]:
rain.loc[0:1]

            City Month  Rainfall
0  San Francisco   Jan      10.0
1        Seattle   Jan      30.0

# Filtering

We can filter rows like this:

In [9]:
#find all rainfall less than 10

rain[rain['Rainfall'] < 10]

             City Month  Rainfall
2     Los Angeles   Jan       2.0
4   San Francisco   Feb       4.0
5     Los Angeles   Feb       0.0
7   San Francisco   Mar       4.0
10  San Francisco   Apr       5.0
11    Los Angeles   Apr       4.0

# Filter Exercises

Complete the following:

In [10]:
# How would we find all reading for Aprils (in all cities)?
rain[rain['Month'] == 'Apr']

             City Month  Rainfall
9         Seattle   Apr       NaN
10  San Francisco   Apr       5.0
11    Los Angeles   Apr       4.0

In [11]:
# How would we find all readings for Los Angeles?
rain[rain['City'] == 'Los Angeles']

           City Month  Rainfall
2   Los Angeles   Jan       2.0
5   Los Angeles   Feb       0.0
8   Los Angeles   Mar       NaN
11  Los Angeles   Apr       4.0

# Naming Rows

We can give rows names instead of numbers.

In [ ]:
rain.set_index(rain['City']  + rain['Month'])

In [ ]:
# Let us try referencing this
rain.loc['San FranciscoJan']  # ERROR!

# Mutated Dataframes

set_index, and many other functions returns a mutated dataframe and does NOT change it in-place. If we want to apply the change we can write on top of the old dataframe.

In [12]:
rain = rain.set_index(rain['City']  + rain['Month'])
                    
rain

                           City Month  Rainfall
San FranciscoJan  San Francisco   Jan      10.0
SeattleJan              Seattle   Jan      30.0
Los AngelesJan      Los Angeles   Jan       2.0
SeattleFeb              Seattle   Feb      20.0
San FranciscoFeb  San Francisco   Feb       4.0
Los AngelesFeb      Los Angeles   Feb       0.0
SeattleMar              Seattle   Mar      22.0
San FranciscoMar  San Francisco   Mar       4.0
Los AngelesMar      Los Angeles   Mar       NaN
SeattleApr              Seattle   Apr       NaN
San FranciscoApr  San Francisco   Apr       5.0
Los AngelesApr      Los Angeles   Apr       4.0

In [13]:
rain.loc['San FranciscoJan']  #Should Work Now

City        San Francisco
Month                 Jan
Rainfall               10
Name: San FranciscoJan, dtype: object